Repository: PirklbauerMario/CustomerData
Catalog: FrmCustomer/FrmCustomer/LangResources.*.resx
Languages: de_de

# ExceptionBankBalForb
source: Invalid Bankbalance!
de_de: Ungültiger Kontostand!

# ExceptionCustNumForb
source: Customer number invalid!
de_de: Kundennummer ungültig!

# ExceptionDayForb
source: Invalid Day in LastChange!
de_de: Ungültiger Tag in LetzteÄnderung!

# ExceptionDBNotEmpty
source: Database should be empty before importing customers!
de_de: Verwenden Sie eine leere Datenbank bevor Kunden importiert werden können!

# ExceptionFirstNameCapitalLetter
source: The first element of your first name should be a capital letter!
de_de: Der erste Buchstabe des Vornamens sollte ein Großbuchstabe sein!

# ExceptionFirstNameEmpty
source: Your first name should have at least one letter!
de_de: Ihr Vorname sollte zumindest einen Buchstaben beinhalten!

# ExceptionFirstNameLetters
source: Your first name should only include letters!
de_de: Ihr Vorname sollte nur Buchstaben beinhalten!

# ExceptionHourForb
source: Invalid Hour in LastChange!
de_de: Ungültige Stunde in LetzteÄnderung!

# ExceptionInvalPassw
source: File could not be read because of invalid password!
de_de: Datei konnte aufgrund eines falschen Passworts nicht gelesen werden!

# ExceptionLastNameCapitalLetter
source: The first element of your last name should be a capital letter!
de_de: Der erste Buchstabe des Nachnamens sollte ein Großbuchstabe sein!

# ExceptionLastNameEmpty
source: Your last name should have at least one letter!
de_de: Ihr Nachname sollte zumindest einen Buchstaben beinhalten!

# ExceptionLastNameLetters
source: Your last name should only include letters!
de_de: Ihr Nachname sollte nur Buchstaben beinhalten!

# ExceptionMailDomain
source: Only letters are allowed as domain!
de_de: Als Domäne dürfen nur Buchstaben verwendet werden!

# ExceptionMailExists
source: This mail still exists! Please choose another one.
de_de: Diese Email existiert bereits!

# ExceptionMailFewSymbBeforeAt
source: Too few symbols before your @ symbol. At least one Symbol is required!
de_de: Zu wenige Symbole vor dem @-Symbol. Min. 1 Symbol!

# ExceptionMailForbSymb
source: Mail contains forbidden symbols!
de_de: Email enthält verbotene Symbole!

# ExceptionMailMuchSymbAfterAt
source: Too few symbols after your @ symbol!
de_de: Zu wenige Symbole nach dem @-Symbol!

# ExceptionMailTooManyAt
source: Mail contains too much @-symbols!
de_de: Email enthält zu viele @-Symbole!

# ExceptionMailToShort
source: Your mail is too short or does not exist an @-Symbol!
de_de: Email ist zu kurz oder enthält kein @-Symbol!

# ExceptionMinuteForb
source: Invalid Minute in LastChange!
de_de: Ungültige Minute in LetzteÄnderung!

# ExceptionMonthForb
source: Invalid Month in LastChange!
de_de: Ungültiges Monat in LetzteÄnderung!

# ExceptionQuickSortForb
source: This SortValue doesn't exist!
de_de: Dieser Sortierparameter existiert nicht!

# ExceptionSecondForb
source: Invalid Second in LastChange!
de_de: Ungültige Sekunde in LetzteÄnderung!

# ExceptionToLessPointsAfterAt
source: Mail contains too less . after your @!
de_de: Email enthält zu wenige . nach dem @-Symbol!

# ExceptionUserNotFound
source: User not found!
de_de: Kunde wurde nicht gefunden!

# ExceptionWrongPassw
source: Password should have at least 1 and max. 16 characters!
de_de: Das Passwort sollte aus mind. 1 und max. 16 Zeichen bestehen.

# ExceptionYearForb
source: Invalid Year in LastChange!
de_de: Ungültiges Jahr in LetzteÄnderung!

# ExpcetionMailFrobPoints
source: Mail contains . on forbidden positions. These are not allowed at the start/end and before/after @!
de_de: Email enthält . an verbotenen Positionen. Diese sind nicht am Beginn/Ende bzw. vor/nach dem @-Symbol erlaubt!

# ExpcetionMailNumSymb
source: Too few/much symbols at the ending. These must be at least 2 and max. 4!
de_de: Zu viele/wenige Symbole im Endteil der Email. Mind. 2 und max. 4 Symbole sind erlaubt!

# ExpcetionMailToMuchPointsAfterAt
source: Mail contains too much . after your @!
de_de: Email enthält zu viele . nach dem @-Symbol!

# FrmEditNumberReq
source: Type in a number!
de_de: Geben Sie eine Nummer ein!

# FrmWelcomeLabelGroupbox
source: Choose Database
de_de: Wähle Datenbank

# Frm1LableBtnAdd
source: Add Customer
de_de: Kunde hinzufügen

# FrmWelcomeLabelRdbLoad
source: Load Database
de_de: Lade Datenbank

# FrmWelcomeLabelRdbNew
source: New Database
de_de: Neue Datenbank

# Frm1DgvLabelHeader1
source: Surname
de_de: Nachname

# Frm1DgvLabelHeader2
source: Forename
de_de: Vorname

# Frm1DgvLabelHeader4
source: Last Change
de_de: Letzte Änderung

# Frm1DgvLabelHeader5
source: Bank Balance
de_de: Kontostand

# Frm1Label1u4
source: Password
de_de: Passwort

# Frm1LabelBtnEdit
source: Edit
de_de: Kunde bearbeiten

# Frm1LabelBtnLoad
source: Load
de_de: Laden

# Frm1LabelBtnPay
source: Payment
de_de: Zahlung durchführen

# Frm1LabelBtnSave
source: Save
de_de: Speichern

# Frm1LabelBtnSearch
source: Search
de_de: Suchen

# Frm1LabelGroupBox2
source: Save Database
de_de: Datenbank speichern

# Frm1LabelGroupBox3
source: Search by:
de_de: Suche nach:

# Frm1LabelGroupBox5
source: Load Database
de_de: Datenbank laden

# Frm1Text
source: Customer Data
de_de: Kundendaten

# FrmAddLabelGroupBox1
source: Forename
de_de: Vorname

# FrmAddLabelGroupBox2
source: Surname
de_de: Nachname

# FrmAddText
source: Add Customer
de_de: Kunde hinzufügen

# FrmEditLabelGroupBox1
source: Customer-Number
de_de: Kundennummer

# FrmEditLabelGroupBox2
source: New-Surname
de_de: Neuer Nachname

# FrmEditLabelGroupBox3
source: New-E-Mail
de_de: Neue E-Mail

# FrmEditText
source: Edit Customer
de_de: Kunde bearbeiten

# FrmPayLabelGroupBox1
source: Customer-Number
de_de: Kundennummer

# FrmPayLabelGroupBox2
source: Payment
de_de: Art der Zahlung

# FrmPayLabelRdb1
source: Inpayment
de_de: Einzahlung

# FrmPayLabelRdb2
source: Outpayment
de_de: Auszahlung

# FrmPayNoCustomer
source: This Customer-Number is not available!
de_de: Kundennummer nicht vorhanden!

# FrmPayText
source: Payment
de_de: Zahlung durchführen

# FrmWelcomeLabel1
source: Paasword
de_de: Passwort

# FrmWelcomeLabelGroupbox3
source: Language
de_de: Sprache

# FrmWelcomeText
source: Welcome
de_de: Willkommen

# MassageBoxSave
source: Successfully stored!
de_de: Erfolgreich gespeichert!

# MassageBoxSearch
source: Sorry, not found!
de_de: Leider nicht gefunden!

# TootipTextSearch
source: You are able to search by: Forename, Surname and Customer Number
de_de: Sie können nach Vornamen, Nachnamen und Kundennummern suchen!

# ExceptionInvalFileName
source: Your chosen Filename is invalid. Please check it again.
de_de: Der gewählte Dateiname ist ungültig. Bitte überprüfen Sie diesen!

# MassegeBoxLoad
source: Database successfully loaded!
de_de: Datenbank wurde erfolgreich geladen!
